# 판다스(pandas) 심화

In [2]:
import numpy as np
import pandas as pd
print("DataFrame: ")
data = {
    'col1':[2,1,9,8,7,4],
    'col2':['A','A','B',np.nan,'D','C'],
    'col3':[0,1,9,4,2,3]
}
index =[1,3,2,5,0,4]
df = pd.DataFrame(data,index=index)
df

DataFrame:

   col1 col2  col3
1     2    A     0
3     1    A     1
2     9    B     9
5     8  NaN     4
0     7    D     2
4     4    C     3

In [15]:
# index axis=0(행)을 축으로 정렬
df = df.sort_index(axis=0) #인덱스를 sort axis=0행,1열 방향
df

   col3 col2  col1
0     2    D     7
1     0    A     2
2     9    B     9
3     1    A     1
4     3    C     4
5     4  NaN     8

In [17]:
# index axis=1(열)을 축으로 정렬, 내림차순
df = df.sort_index(axis=1, ascending =False) #인덱스를 sort axis=0행,1열 방향
df

   col3 col2  col1
0     2    D     7
1     0    A     2
2     9    B     9
3     1    A     1
4     3    C     4
5     4  NaN     8

In [20]:
# sort_value
sorted_df1 = df.sort_values('col1', ascending = True)
sorted_df1

   col3 col2  col1
3     1    A     1
1     0    A     2
4     3    C     4
0     2    D     7
5     4  NaN     8
2     9    B     9

In [21]:
# sort_value 2
sorted_df2 = df.sort_values(['col2','col1'], ascending = [True,False])
sorted_df2

   col3 col2  col1
1     0    A     2
3     1    A     1
2     9    B     9
4     3    C     4
0     2    D     7
5     4  NaN     8

In [44]:
# 데이터 프레임의  index와 columns
import numpy as np
import pandas as pd
data = {
    'korean':[50,60,70,30],
    'math':[30,np.nan,40,20]
}
index = ['a','b','c','d']
df = pd.DataFrame(data,index=index)
print(df.index)
print(df.columns)
df

Index(['a', 'b', 'c', 'd'], dtype='object')
Index(['korean', 'math'], dtype='object')

   korean  math
a      50  30.0
b      60   NaN
c      70  40.0
d      30  20.0

In [47]:
# count() 함수
print(df.count(axis=0)) # axis = 0 기본값(생략가능)
print(df.count(axis=1))

korean    4
math      3
dtype: int64
a    2
b    1
c    2
d    2
dtype: int64

In [ ]:
#max(), min(), sum(), mean()

print(df.max())
print(df.max(axis=1))
print(df.min())
print(df.min(axis=1))
print(df.sum())
print(df.sum(axis=1))
print(df.mean())
print(df.mean(axis=1))
print(df.mean(axis=1,skipna=False)) # NaN값 보이게 하기

In [53]:
# 결측값 대체 fiilna
avg = df['math'].mean()
df['math'] = df['math'].fillna(avg)
df

   korean  math
a      50  30.0
b      60  30.0
c      70  40.0
d      30  20.0